# Pandas DataFrame: Filters and Operations

In [1]:
import pandas as pd
import numpy as np

pd.__version__, np.__version__

('0.25.3', '1.17.4')

In [2]:
data = {
    
     'vivek' : [35, 'M', 'Trainer'] ,
     'john'  : [22, 'M', 'Gardener'] ,
     'jill'  : [19, 'F', 'Accountant'] ,
     'ravi'  : [42, 'M', 'Sales'] 
}

df1 = pd.DataFrame(data, index=['age', 'sex', 'profession'])

df1

              vivek      john        jill   ravi
age              35        22          19     42
sex               M         M           F      M
profession  Trainer  Gardener  Accountant  Sales

### Transpose

In [3]:
df2 = df1.T

df2

      age sex  profession
vivek  35   M     Trainer
john   22   M    Gardener
jill   19   F  Accountant
ravi   42   M       Sales

In [ ]:
df2.age < 30

In [ ]:
df2[ df2.age < 30 ]

In [ ]:
df2[ (df2.age < 30) & ( df2.sex == 'M')]

### Adding a new Column

In [ ]:
df2['salary'] = [ 9000 , 3000 , 25000 , 10000 ]

df2

#### Dervied Columns

In [ ]:
df2['young'] = df2.age < 30

df2

In [ ]:
del df2['young']  # hate being told I am getting older

df2

In [ ]:
df2.loc['jim'] = [ 56, 'M', 'Hacker', 0]

df2

In [ ]:
df3 = df2.drop('jim', axis=0)  # Drop is not inplace like del

df2

In [ ]:
df3

### Statistics

In [ ]:
df2

In [ ]:
df2.describe()

In [ ]:
df2.age.describe()

In [ ]:
df2.age.mean()

In [ ]:
df2.T

In [ ]:
df2.T.ix[0].mean()

### Resetting Index

In [ ]:
df2

In [ ]:
df2.reset_index()

In [ ]:
# Let's make sure the new column gets a good name by default 

df2.index.name = 'name'

df4 = df2.reset_index()

df4

In [ ]:
df2

In [ ]:
df2.reset_index(inplace=True)

df2

In [ ]:
df2.set_index('name', inplace=True)

df2